zhanzr/xmc1100-cpp/main.cpp
#include <iostream>
#include <string>
#include <memory>
#include <iomanip>

#include <XMC1100.h>

#include "led.h"
#include "dbg.h"
#include "serial.h"

using namespace std;

__IO uint32_t g_Ticks;

void test_normal_ptr(void) {	
//	cout << __func__ << endl;
	
	LED* p_auto_led1 (new LED(0));
	__IO uint32_t tmpTick;
	
		LED* p_auto_led2 = p_auto_led1; 
		
		tmpTick = g_Ticks;
		while((tmpTick+400) > g_Ticks) {
		}	
		
		p_auto_led2->Toogle(); 
		tmpTick = g_Ticks;
		while((tmpTick+400) > g_Ticks) {
		}				

		p_auto_led1->Toogle(); 	
		
//		cout << hex << endl;
//		cout << setw(8);
//    cout << setfill('0');
//		cout << p_auto_led1  << ' ' << p_auto_led2 << endl;
//		cout << dec << endl;

		//Leaking memory
}

void test_auto_ptr(void) {
//	cout << __func__ << endl;

	auto_ptr<LED> p_auto_led1 (new LED(0));
	__IO uint32_t tmpTick;
	
		// Copy and transfer ownership. 																			
		// p_auto_led1 gets set to empty!
		auto_ptr<LED> p_auto_led2 = p_auto_led1; 
		
		tmpTick = g_Ticks;
		while((tmpTick+400) > g_Ticks) {
		}	
		
		// Works.
		if(nullptr != p_auto_led2.get()) {
//			cout << "non null pointer, will work" << endl;
			p_auto_led2.get()->Toogle(); 
			tmpTick = g_Ticks;
			while((tmpTick+400) > g_Ticks) {
				__NOP();
				__WFI();
			}				
		} else {
//			cout << "null pointer, will not work" << endl;
		}
		
		// Hopefully raises some NULL pointer exception.		
		if(nullptr != p_auto_led1.get()) {
			cout << "non null pointer, will work" << endl;
			p_auto_led1.get()->Toogle(); 
			tmpTick = g_Ticks;
			while((tmpTick+400) > g_Ticks) {
			}				
		} else {
//			cout << "null pointer, will not work" << endl;
		}		
		
//		cout << hex << endl;
//		cout << setw(8);
//    cout << setfill('0');
//		cout << p_auto_led1.get()  << ' ' << p_auto_led2.get() << endl;
//		cout << dec << endl;
		
		//Will call destructor via the owner of the pointer
//	cout << "exit " << __func__ << endl;
}
		
int main(void) {
  /* System timer configuration */
  ::SysTick_Config(SystemCoreClock / HZ);
	
	cout<<"Start @"<<SystemCoreClock/1000000<<" MHz"<<endl;
//	cout << XMC_LIB_MAJOR_VERSION << ' ' << XMC_LIB_MINOR_VERSION << ' ' << XMC_LIB_PATCH_VERSION <<endl;

	__IO uint32_t tmpTick;

	while (1) {
//		cout << hex << endl;
//		cout << setw(8);
//    cout << setfill('0');
//		cout << SystemCoreClock  << ' ' << &SystemCoreClock << endl;
//		cout << dec << endl;
		
		test_normal_ptr();
		test_auto_ptr();		
		
		cout << endl;
		tmpTick = g_Ticks;
		while((tmpTick+4000) > g_Ticks) {
		}		
		
  }
}
